app/views/albums/edit.html.erb

SELECT "photos".* FROM "photos" WHERE "photos"."album_id" = ?  [["album_id", 42]]
---

	<% @album.photos.each do |p|%>