app/views/albums/show.html.erb

<div class="row">
	<% @album.photos.each do |p|%>
---
SELECT  "photos".* FROM "photos" WHERE "photos"."album_id" = ? AND "photos"."id" = ? LIMIT 1  [["album_id", 40], ["id", 40]]