app/controllers/albums_controller.rb

INSERT INTO "albums" ("name", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "qwer"], ["description", "qwrewq"], ["user_id", 2], ["created_at", "2015-06-01 04:35:08.898358"], ["updated_at", "2015-06-01 04:35:08.898358"]]
---
	def create
		debugger
		@album =current_user.albums.new(album_params)
		#@album.photos.first.tags.first[:id]=Tag.where(name: @album.photos.first.tags.first.name).first.id
		if
			@album.save

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT 1  [["id", 12]]
UPDATE "albums" SET "description" = ?, "user_id" = ?, "updated_at" = ? WHERE "albums"."id" = ?  [["description", "gdftr"], ["user_id", 2], ["updated_at", "2015-06-01 04:31:14.014937"], ["id", 20]]
---
	def update
  		@album = Album.find(params[:id])

  		if @album.update(album_params)

SELECT "albums".* FROM "albums" WHERE "albums"."user_id" = ?  [["user_id", 2]]
---
	def index
		@albums=current_user.albums.all