app/controllers/photos_controller.rb

SELECT "albums".* FROM "albums"
---
  def new
  	@album = Album.new
  	@album = Album.all

INSERT INTO "photos" ("name", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
  	@photo = Photo.new(photo_params)

  	if
  		@photo.save

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", 4]]
---
  def edit
	@photo = Photo.find(params[:id])

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "photos" SET "avatar_file_name" = ?, "avatar_file_size" = ?, "avatar_updated_at" = ?, "updated_at" = ? WHERE "photos"."id" = ?  [["avatar_file_name", "Flower_Pictures_1.jpg"], ["avatar_file_size", 35950], ["avatar_updated_at", "2015-06-01 12:27:52.346832"], ["updated_at", "2015-06-01 12:27:52.509339"], ["id", 4]]
---
  def update
  	@photo = Photo.find(params[:id])

	if @photo.update(photo_params)